dictionary = {
    "Имя": ["Андрей", "Кирилл", "Анна", "Евгений", "Евгений", "Александр", "Татьяна", "Аркадий", "Игорь", "Кирилл"],
    "Фамилия": ["Иванов", "Лазарев", "Петрова", "Надобников", "Никитин", "Иванов", "Никитина", "Лихачев", "Никитин",
                "Левашев"],
    "Город проживания": ["Москва", "Омск", "Псков", "Псков", "Москва", "Псков", "Москва", "Омск", "Псков", "Москва"],
    "Год рождения": [2000, 1987, 2003, 1993, 2001, 2001, 1976, 1957, 1969, 1999],
    "Месяц рождения": [6, 4, 11, 12, 9, 9, 5, 2, 3, 6],
    "Число рождения": [11, 25, 5, 3, 27, 31, 13, 12, 28, 24],
    "Статус": ["Студент", "Работает", "Школьница", "Работает", "Студент", "Студент", "Работает", "Пенсия", "Работает",
               "Студент"]
    }
updated_data = {
    "Фамилия Имя": [],
    "Дата рождения": [],
    "Город проживания": [],
    "Статус": []
}
for i in range(len(dictionary["Имя"])):
    name = dictionary["Имя"][i]
    surname = dictionary["Фамилия"][i]
    city = dictionary["Город проживания"][i]
    dob_year = str(dictionary["Год рождения"][i])
    dob_month = str(dictionary["Месяц рождения"][i]).zfill(2)
    dob_day = str(dictionary["Число рождения"][i]).zfill(2)
    status = dictionary["Статус"][i]
    if name == "Кирилл":
        name = "Кириллл"
    if surname == "Никитин" and city == "Москва":
        city = "Махачкала"
    if name == "Иванов" and surname == "Александр":
        status = "Работает"
    if name == "Лихачев" and surname == "Аркадий":
        continue
    updated_data["Фамилия Имя"].append(surname + " " + name)
    updated_data["Дата рождения"].append(f"{dob_year}-{dob_month}-{dob_day}")
    updated_data["Город проживания"].append(city)
    updated_data["Статус"].append(status)

print(updated_data)